---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.StairsLandingType
source: html/ae4743d6-0c92-a953-5763-7e3fd04c4b55.htm
---
# StairsLandingType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.